date = {"01":"первое", "02":"второе", "03":"третье", "04":"четвертое", "05":"пятое", "06":"шестое", "07":"седьмое", "08":"восьмое",
        "09":"девятое", "10":"десятое", "11":"одинадцатое", "12":"двенадцатое", "13":"тринадцатое", "14":"четырнадцатое", "15":"пятнадцатое", "16":"шестнадцатое",
        "17":"семнадцатое", "18":"восемнадцатое", "19":"девятнадцатое", "20":"двадцатое", "21":"двадцать первое", "22":"двадцать второе", "23":"двадцать третье",
        "24":"двадцать четвертое", "25":"двадцать пятое", "26":"двадцать шестое", "27":"двадцать седьмое", "28":"двадцать восьмое", "29":"двадцать девятое", "30":"тридцатое",
        "31":"тридцать первое"}
month = {"01":"январь", "02":"февраль", "03":"март", "04":"апрель", "05":"май", "06":"июнь", "07":"июль", "08":"август", "09":"сентябрь", "10":"октябрь", "11":"ноябрь",
         "12":"декабрь"}
UserDate = input('DD.MM.YYYY: ')
print('{} {} {} года'.format(date[UserDate[0:2]], month[UserDate[3:5]], year[UserDate[6:9]])
