import os
import shutil

'''
# Задача-2:
# Напишите скрипт, отображающий папки текущей директории.
 
# содержание директории
'''

def dir_contains():
    current_contains = [os.listdir()]
    print(current_contains)
    
